app/controllers/like_projects_controller.rb

  def create
    @like = Like.find_by(user: current_user)
    @project = Project.find_by(id: params[:project_id])
    @like_project = LikeProject.new(like: @like, project: @project)
      if @like_project.save
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 LIMIT $2  [["user_id", 47], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
INSERT INTO "like_projects" ("project_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["project_id", 1], ["created_at", "2020-03-24 14:04:57.006136"], ["updated_at", "2020-03-24 14:04:57.006136"]]