app/controllers/projects_controller.rb

SELECT "cities".* FROM "cities"
---
	def index

	  @projects = apply_scopes(Project).all
	  @cities = City.all